Revit 2027 API
PanelTypeSet.Insert Method
Insert the specified panel type into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	PanelType item
)
Public Overridable Function Insert (
	item As PanelType
) As Boolean
public:
virtual bool Insert(
	PanelType^ item
)
abstract Insert :
        item : PanelType -> bool
override Insert :
        item : PanelType -> bool
Parameters
item PanelType
The panel type to be inserted into the set.
Return Value
Boolean
Returns whether the panel type was inserted into the set.
See Also
Reference
PanelTypeSet Class
Autodesk.Revit.DB Namespace